app/controllers/blocking_clients_controller.rb

  def index
    @blocking_clients = BlockingClient.all
---
SELECT "blocking_clients".* FROM "blocking_clients"

  def show
    @blocking_client = BlockingClient.find(params[:id])
---
SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "1"]]

  def edit
    @blocking_client = BlockingClient.find(params[:id])
---
SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "1"]]

  def create
    @blocking_client = BlockingClient.new(params[:blocking_client])

    respond_to do |format|
      if @blocking_client.save
---
INSERT INTO "blocking_clients" ("car_number", "created_at", "lat", "long", "updated_at") VALUES (?, ?, ?, ?, ?)  [["car_number", "b12abc"], ["created_at", Sat, 01 Mar 2014 13:54:18 UTC +00:00], ["lat", 43.111], ["long", 44.111], ["updated_at", Sat, 01 Mar 2014 13:54:18 UTC +00:00]]

  def update
    @blocking_client = BlockingClient.find(params[:id])

    respond_to do |format|
      if @blocking_client.update_attributes(params[:blocking_client])
---
SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "8"]]
UPDATE "blocking_clients" SET "car_number" = 'b30abc', "lat" = 44.0, "long" = 22.0, "updated_at" = '2014-03-01 19:03:11.355423' WHERE "blocking_clients"."blocking_client_id" = 1

  def destroy
    @blocking_client = BlockingClient.find(params[:id])
    @blocking_client.destroy
---
SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "2"]]
DELETE FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ?  [["blocking_client_id", 2]]