app/controllers/operation_controller.rb

INSERT INTO "blocking_clients" ("car_number", "created_at", "lat", "long", "updated_at") VALUES (?, ?, ?, ?, ?)  [["car_number", "B13ABC"], ["created_at", Sat, 01 Mar 2014 14:25:58 UTC +00:00], ["lat", 42.13521324], ["long", 43.1234421], ["updated_at", Sat, 01 Mar 2014 14:25:58 UTC +00:00]]
---
	def register
	# car_number, lat, long
		if !params[:car_number] || !params[:lat] || !params[:long]
			message = "Invalid registration, try again!"
		else
			correct_params={}
			correct_params[:car_number]=params[:car_number]
			correct_params[:lat]=params[:lat]
			correct_params[:long]=params[:long]
      @blocking_client = BlockingClient.new(correct_params)
      if @blocking_client.save

SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "8"]]
SELECT "messages".* FROM "messages" WHERE "messages"."blocking_client_id" = 8
UPDATE "messages" SET "unread" = 'f', "updated_at" = '2014-03-01 17:21:11.976117' WHERE "messages"."message_id" = 1
---
	def get_messages
	# blocking_client_id
		if !params[:blocking_client_id]
			message = "Invalid get messages call, try again!"
		else
			begin
				@blocking_client = BlockingClient.find(params[:blocking_client_id])
				@messages = @blocking_client.messages
				nr_msg = 0
				msg_text = ""
				@messages.each do |msg|
					if msg.unread
						msg_text+=msg.message_text+"\n"
						nr_msg=nr_msg+1
						msg.unread = false
						msg.save

SELECT "blocking_clients".* FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ? LIMIT 1  [["blocking_client_id", "5"]]
SELECT "messages".* FROM "messages" WHERE "messages"."blocking_client_id" = 8
DELETE FROM "messages" WHERE "messages"."message_id" = ?  [["message_id", 1]]
DELETE FROM "blocking_clients" WHERE "blocking_clients"."blocking_client_id" = ?  [["blocking_client_id", 5]]
---
	def unregister
	# blocking_client_id
		if !params[:blocking_client_id]
			message = "Invalid unregistration, try again!"
		else
			begin
				@blocking_client = BlockingClient.find(params[:blocking_client_id])
				@messages = @blocking_client.messages
				@messages.each do |message|
					message.destroy
				end
				@blocking_client.destroy

SELECT "blocking_clients".* FROM "blocking_clients"
INSERT INTO "messages" ("blocking_client_id", "created_at", "message_text", "unread", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def search
	#car_number, lat, long
		puts params.to_s

		if !params[:car_number] || !params[:lat] || !params[:long]
			message = "Invalid search parameters, try again!"
		else
			@notified = false
			BlockingClient.all.each do |car|
				if car.car_number == params[:car_number] and distance([params[:lat].to_f, params[:long].to_f], [car.lat, car.long]) < 1000
					correct_params={}
					correct_params[:blocking_client_id]=car.blocking_client_id
					correct_params[:message_text]="You are blocking someone!"
					correct_params[:unread]=true
					@message = Message.new(correct_params)
				  if @message.save